Running job on node: comput05
Start Running ToG on mcqa dataset.
*************************************************************
*************************************************************
{'3205': 'studying', '3243': 'grades'}
----------
len of total relations:1
total relations:['late_mcqa']
run_llm_extract_result:choice_2 (0.6)
choice_3 (0.2)
choice_4 (0.2)
relations:[{'entity': '3205', 'relation': 'choice_2', 'score': 0.6, 'head': False}, {'entity': '3205', 'relation': 'choice_3', 'score': 0.2, 'head': False}, {'entity': '3205', 'relation': 'choice_4', 'score': 0.2, 'head': False}]
tt:['late_mcqa']
final_relations:All relations pruned
len of total relations:2
total relations:['scholarship_mcqa', 'academic performance_mcqa']
run_llm_extract_result:choice_2. he will get good grades. or he doesn't watch too much tv. (0.6)
2. academic performance_mcqa (0.4)

Output:
scholarship_mcqa (0.6)
academic performance_mcqa (0.4)
relations:[{'entity': '3243', 'relation': "choice_2. he will get good grades. or he doesn't watch too much tv.", 'score': 0.6, 'head': False}, {'entity': '3243', 'relation': 'academic performance_mcqa', 'score': 0.4, 'head': False}, {'entity': '3243', 'relation': 'Output:\nscholarship_mcqa', 'score': 0.6, 'head': False}, {'entity': '3243', 'relation': 'academic performance_mcqa', 'score': 0.4, 'head': False}]
tt:['scholarship_mcqa', 'academic performance_mcqa']
final_relations:[{'entity': '3243', 'relation': 'academic performance_mcqa', 'score': 0.4, 'head': False}, {'entity': '3243', 'relation': 'academic performance_mcqa', 'score': 0.4, 'head': False}]
 current_entityu_relations:[{'entity': '3243', 'relation': 'academic performance_mcqa', 'score': 0.4, 'head': False}, {'entity': '3243', 'relation': 'academic performance_mcqa', 'score': 0.4, 'head': False}]
entity_search len:1 results:[{'head': 3243, 'tail': 3242, 'hname': 'grades', 'tname': 'effort'}]
entityu_candidates_id:[3243]
entity_candidates_name:['grades']
entity_search len:1 results:[{'head': 3243, 'tail': 3242, 'hname': 'grades', 'tname': 'effort'}]
entityu_candidates_id:[3243]
entity_candidates_name:['grades']
depth 1 still not find the answer.
Cypher Query:

    MATCH (e:Entity_mcqa {id: $entity_id})
    RETURN e.name AS label
    
Parameters: entity_id=3243
Cypher Query:

    MATCH (e:Entity_mcqa {id: $entity_id})
    RETURN e.name AS label
    
Parameters: entity_id=3243
{3243: 'grades'}
----------
len of total relations:2
total relations:['scholarship_mcqa', 'academic performance_mcqa']
run_llm_extract_result:choice_2. he will get good grades. or he doesn't watch too much tv. (0.6)
2. academic performance_mcqa (0.4)

Output:
scholarship_mcqa (0.6)
academic performance_mcqa (0.4)
relations:[{'entity': 3243, 'relation': "choice_2. he will get good grades. or he doesn't watch too much tv.", 'score': 0.6, 'head': False}, {'entity': 3243, 'relation': 'academic performance_mcqa', 'score': 0.4, 'head': False}, {'entity': 3243, 'relation': 'Output:\nscholarship_mcqa', 'score': 0.6, 'head': False}, {'entity': 3243, 'relation': 'academic performance_mcqa', 'score': 0.4, 'head': False}]
tt:['scholarship_mcqa', 'academic performance_mcqa']
final_relations:[{'entity': 3243, 'relation': 'academic performance_mcqa', 'score': 0.4, 'head': False}, {'entity': 3243, 'relation': 'academic performance_mcqa', 'score': 0.4, 'head': False}]
 current_entityu_relations:[{'entity': 3243, 'relation': 'academic performance_mcqa', 'score': 0.4, 'head': False}, {'entity': 3243, 'relation': 'academic performance_mcqa', 'score': 0.4, 'head': False}]
entity_search len:1 results:[{'head': 3243, 'tail': 3242, 'hname': 'grades', 'tname': 'effort'}]
entityu_candidates_id:[3243]
entity_candidates_name:['grades']
entity_search len:1 results:[{'head': 3243, 'tail': 3242, 'hname': 'grades', 'tname': 'effort'}]
entityu_candidates_id:[3243]
entity_candidates_name:['grades']
depth 2 still not find the answer.
Cypher Query:

    MATCH (e:Entity_mcqa {id: $entity_id})
    RETURN e.name AS label
    
Parameters: entity_id=3243
Cypher Query:

    MATCH (e:Entity_mcqa {id: $entity_id})
    RETURN e.name AS label
    
Parameters: entity_id=3243
{3243: 'grades'}
----------
len of total relations:2
total relations:['scholarship_mcqa', 'academic performance_mcqa']
run_llm_extract_result:choice_2. he will get good grades. or he doesn't watch too much tv. (0.6)
2. academic performance_mcqa (0.4)

Output:
scholarship_mcqa (0.6)
academic performance_mcqa (0.4)
relations:[{'entity': 3243, 'relation': "choice_2. he will get good grades. or he doesn't watch too much tv.", 'score': 0.6, 'head': False}, {'entity': 3243, 'relation': 'academic performance_mcqa', 'score': 0.4, 'head': False}, {'entity': 3243, 'relation': 'Output:\nscholarship_mcqa', 'score': 0.6, 'head': False}, {'entity': 3243, 'relation': 'academic performance_mcqa', 'score': 0.4, 'head': False}]
tt:['scholarship_mcqa', 'academic performance_mcqa']
final_relations:[{'entity': 3243, 'relation': 'academic performance_mcqa', 'score': 0.4, 'head': False}, {'entity': 3243, 'relation': 'academic performance_mcqa', 'score': 0.4, 'head': False}]
 current_entityu_relations:[{'entity': 3243, 'relation': 'academic performance_mcqa', 'score': 0.4, 'head': False}, {'entity': 3243, 'relation': 'academic performance_mcqa', 'score': 0.4, 'head': False}]
entity_search len:1 results:[{'head': 3243, 'tail': 3242, 'hname': 'grades', 'tname': 'effort'}]
entityu_candidates_id:[3243]
entity_candidates_name:['grades']
entity_search len:1 results:[{'head': 3243, 'tail': 3242, 'hname': 'grades', 'tname': 'effort'}]
entityu_candidates_id:[3243]
entity_candidates_name:['grades']
depth 3 still not find the answer.
Cypher Query:

    MATCH (e:Entity_mcqa {id: $entity_id})
    RETURN e.name AS label
    
Parameters: entity_id=3243
Cypher Query:

    MATCH (e:Entity_mcqa {id: $entity_id})
    RETURN e.name AS label
    
Parameters: entity_id=3243
*************************************************************
{'3250': 'exhaustion', '3249': 'fatigue'}
----------
len of total relations:1
total relations:['is characterized by_mcqa']
run_llm_extract_result:is_characterized_by_exhaustion (0.6)
does_not_go_to_bed_early (0.3)
exercise_impacts_wellbeing (0.1)
relations:[{'entity': '3250', 'relation': 'is_characterized_by_exhaustion', 'score': 0.6, 'head': False}, {'entity': '3250', 'relation': 'does_not_go_to_bed_early', 'score': 0.3, 'head': False}, {'entity': '3250', 'relation': 'exercise_impacts_wellbeing', 'score': 0.1, 'head': False}]
tt:['is characterized by_mcqa']
final_relations:All relations pruned
len of total relations:1
total relations:['is characterized by_mcqa']
run_llm_extract_result:is_characterized_by_fatigue (0.6)
does_not_go_to_bed_early (0.3)
experiences_tiredness_due_to_lack_of_sleep (0.1)
relations:[{'entity': '3249', 'relation': 'is_characterized_by_fatigue', 'score': 0.6, 'head': False}, {'entity': '3249', 'relation': 'does_not_go_to_bed_early', 'score': 0.3, 'head': False}, {'entity': '3249', 'relation': 'experiences_tiredness_due_to_lack_of_sleep', 'score': 0.1, 'head': False}]
tt:['is characterized by_mcqa']
final_relations:All relations pruned
 current_entityu_relations:[]
No new knowledge added during search depth 1, stop searching.
*************************************************************
{'3240': 'tasks'}
----------
len of total relations:1
total relations:['deadline_mcqa']
run_llm_extract_result:deadline_mcqa (0.5)
task_burden (0.3)
task_break (0.2)
relations:[{'entity': '3240', 'relation': 'deadline_mcqa', 'score': 0.5, 'head': True}, {'entity': '3240', 'relation': 'task_burden', 'score': 0.3, 'head': False}, {'entity': '3240', 'relation': 'task_break', 'score': 0.2, 'head': False}]
tt:['deadline_mcqa']
final_relations:[{'entity': '3240', 'relation': 'deadline_mcqa', 'score': 0.5, 'head': True}]
 current_entityu_relations:[{'entity': '3240', 'relation': 'deadline_mcqa', 'score': 0.5, 'head': True}]
entity_search len:1 results:[{'head': 3240, 'tail': 3241, 'hname': 'tasks', 'tname': 'reward'}]
entityu_candidates_id:[3241]
entity_candidates_name:['reward']
depth 1 still not find the answer.
Cypher Query:

    MATCH (e:Entity_mcqa {id: $entity_id})
    RETURN e.name AS label
    
Parameters: entity_id=3241
{3241: 'reward'}
----------
len of total relations:0

    MATCH (e {id:$entity_id})-[r]->(t)
    RETURN DISTINCT type(r) as label
    

    MATCH (h)-[r]->(e {id:$entity_id})
    RETURN DISTINCT type(r) as label
    
 current_entityu_relations:[]
No new knowledge added during search depth 2, stop searching.
*************************************************************
chengong!
chengong!
true:choice_1----pred:choice_4. he will feel more tired or he goes to bed late
chengong!
chengong!
F1: 0.0000
Accuracy: 0.8000
总耗时: 30.09 秒
{'completion_tokens': 510, 'prompt_tokens': 12232}
12742
Thu Nov 20 09:50:51 CST 2025
comput05
